import { useState, useEffect } from "react";
import "../node_modules/bootstrap/dist/css/bootstrap.min.css";
import 'bootstrap';
import './App.css';
import InfoTableWithBtn from "./InfoTableWithBtn";

function App() {
  const [demoData, setDemoData] = useState({
    id: 1,
    title: "人事行政",
    tableData: [
      {
        type: "thead",
        rows: [
          ["年度", "等別", "報考人數", "到考人數"]
        ]
      },
      {
        type: "tbody",
        rows: [
          [{ content: "113年", rowSpan: 2 }, "高考三級", "3,326", "2,291"],
          ["普通考試", "2,884", "2,192"]
        ]
      },
      {
        type: "thead",
        rows: [
          ["需用人數", "錄取分數", "錄取人數", "錄取率"]
        ]
      },
      {
        type: "tbody",
        rows: [
          ["159", "56.65", "165", "7.20%"],
          ["46", "70.80", "118", "5.38%"]
        ]
      }
    ],
    workInfo: "人事行政－公務幕僚的關鍵單位。人事行政在機關中扮演著重要的幕僚角色，致力於提供對機關同仁人事法規的諮詢和建議。其範疇包括休假、陞遷、考績、退休等重要事項，為機關內同仁提供全方位的支援和指導。這項工作需要具備豐富的知識和技能，這些素養將為專業人士未來的發展提供強大的助力，使其在職場上擁有更多的機會和選擇。"
  });
  const [tableData, setTableData] = useState([]);
  useEffect(() => {
    let tableDataJson = [
      {
        id: 1,
        title: "人事行政",
        tableData: [
          {
            type: "thead",
            rows: [
              ["年度", "等別", "報考人數", "到考人數"]
            ]
          },
          {
            type: "tbody",
            rows: [
              [{ content: "113年", rowSpan: 2 }, "高考三級", "3,326", "2,291"],
              ["普通考試", "2,884", "2,192"]
            ]
          },
          {
            type: "thead",
            rows: [
              ["需用人數", "錄取分數", "錄取人數", "錄取率"]
            ]
          },
          {
            type: "tbody",
            rows: [
              ["159", "56.65", "165", "7.20%"],
              ["46", "70.80", "118", "5.38%"]
            ]
          }
        ],
        workInfo: "人事行政－公務幕僚的關鍵單位。人事行政在機關中扮演著重要的幕僚角色，致力於提供對機關同仁人事法規的諮詢和建議。其範疇包括休假、陞遷、考績、退休等重要事項，為機關內同仁提供全方位的支援和指導。這項工作需要具備豐富的知識和技能，這些素養將為專業人士未來的發展提供強大的助力，使其在職場上擁有更多的機會和選擇。"
      },
      {
        id: 2,
        title: "一般民政",
        tableData: [
          {
            type: "thead",
            rows: [
              ["年度", "等別", "報考人數", "到考人數"]
            ]
          },
          {
            type: "tbody",
            rows: [
              [{ content: "113年", rowSpan: 2 }, "高考三級", "813", "566"],
              ["普通考試", "2,061", "1,520"]
            ]
          },
          {
            type: "thead",
            rows: [
              ["需用人數", "錄取分數", "錄取人數", "錄取率"]
            ]
          },
          {
            type: "tbody",
            rows: [
              ["39", "56.78", "47", "8.30%"],
              ["114", "68.80", "158", "10.39%"]
            ]
          }
        ],
        workInfo: "一般民政－最具親和力的基層第一線。該類組強調培養基層服務能力，提供廣泛的社會福利專業知識，並期望具備協調、溝通、解決問題和法律熟悉等多元能力。主要目標是為民眾提供有效的民政服務，同時保障合法性並維護民眾的權益。工作中需要直接接觸民眾，處理各種申請事項，因此適合喜歡人際互動的人選擇。考試科目相對大眾化，不限於公行系或政治系畢業者，任何背景的考生都可輕鬆入門，讓更多人有機會參與並貢獻於民政事務。"
      },
      {
        id: 3,
        title: "一般行政",
        tableData: [
          {
            type: "thead",
            rows: [
              ["年度", "等別", "報考人數", "到考人數"]
            ]
          },
          {
            type: "tbody",
            rows: [
              [{ content: "113年", rowSpan: 2 }, "高考三級", "4,039", "2,730"],
              ["普通考試", "6,775", "4,988"]
            ]
          },
          {
            type: "thead",
            rows: [
              ["需用人數", "錄取分數", "錄取人數", "錄取率"]
            ]
          },
          {
            type: "tbody",
            rows: [
              ["175", "58.86", "216", "7.91%"],
              ["229", "72.40", "368", "7.38%"]
            ]
          }
        ],
        workInfo: "一般行政－培養行政能力的類科。一般行政類科培養公務人員具備組織管理與行政能力，強調核心領域包括組織管理、法律與法規、政策分析與制定等學習，同時提供廣泛的公共事務專業知識，及掌握有效的組織運作、合法性與合規性、政策制定和專業知識，以應對公共事務挑戰，成為卓越的公務人員。考試科目和工作內容相對較大眾化，不限公共行政或政治學系畢業，容易上手。"
      },
      {
        id: 4,
        title: "圖書資訊管理",
        tableData: [
          {
            type: "thead",
            rows: [
              ["年度", "等別", "報考人數", "到考人數"]
            ]
          },
          {
            type: "tbody",
            rows: [
              [{ content: "113年", rowSpan: 2 }, "高考三級", "260", "182"],
              ["普通考試", "266", "185"]
            ]
          },
          {
            type: "thead",
            rows: [
              ["需用人數", "錄取分數", "錄取人數", "錄取率"]
            ]
          },
          {
            type: "tbody",
            rows: [
              ["20", "64.64", "21", "11.54%"],
              ["12", "58.80", "17", "9.19%"]
            ]
          }
        ],
        workInfo: "圖書資訊管理－優質圖書資訊的提供者。圖書資訊管理錄取後，主要分發到國(市)立圖書館及各大國立大專院校圖書館，圖書館工作的特點是工作內容較為專精，包括圖書分編、參考服務(提供讀者諮詢)、採訪編目(採買館藏資料、編目處理)等。在圖書館工作中，圖書分編項目相對較為穩定，因需要累積經驗；其他工作則採輪調制。圖書資訊管理類科不限科系背景，任何人皆可報考，如果您是管理學群或資訊學群的考生，報考將更具競爭優勢。"
      },
      {
        id: 5,
        title: "環保行政",
        tableData: [
          {
            type: "thead",
            rows: [
              ["年度", "等別", "報考人數", "到考人數"]
            ]
          },
          {
            type: "tbody",
            rows: [
              [{ content: "113年", rowSpan: 2 }, "高考三級", "293", "196"],
              ["普通考試", "182", "129"]
            ]
          },
          {
            type: "thead",
            rows: [
              ["需用人數", "錄取分數", "錄取人數", "錄取率"]
            ]
          },
          {
            type: "tbody",
            rows: [
              ["19", "50.64", "25", "12.76%"],
              ["13", "51.80", "30", "23.26%"]
            ]
          }
        ],
        workInfo: "環保行政－環境保護最佳推手。社會對『環保』與『永續經營』的重視日益凸顯。高普考提供多項相關科目，如環保行政、環境檢驗、環境技術等。其中，環保行政不限科系科，對於非相關科系的考生，尤其適合參與環保行政，提供跨領域機會。這不僅豐富了取才多樣性，也促進了各背景考生參與環保事業，全面應對永續挑戰，為社會盡一份心力。"
      },
      {
        id: 6,
        title: "客家事務行政",
        tableData: [
          {
            type: "thead",
            rows: [
              ["年度", "等別", "等別", "報考人數", "到考人數"]
            ]
          },
          {
            type: "tbody",
            rows: [
              [{ content: "113年", rowSpan: 4 }, { content: "高考三級", rowSpan: 2 }, "二試", "-", "-"],
              ["一試", "70", "44"],
              [{ content: "普通考試", rowSpan: 2 }, "二試", "-", "-"],
              ["一試", "106", "60"]
            ]
          },
          {
            type: "thead",
            rows: [
              ["需用人數", "錄取分數", "錄取人數", "錄取率"]
            ]
          },
          {
            type: "tbody",
            rows: [
              [{ content: "5", rowSpan: 2 }, "-", "-", "-"],
              ["54.14", "11", "25.00%"],
              [{ content: "5", rowSpan: 2 }, "-", "-", "-"],
              ["61.00", "13", "21.67%"]
            ]
          }
        ],
        workInfo: "客家事務行政－振興客家文化創意產業的推手。客家事務行政致力於推動和保護客家文化及培養專業人才，工作範疇包括推廣客家事務政策、制定法規和計畫，研究和傳承客家語言、教育、文化、民俗禮儀和技藝，培育客家人才，推動客家傳播媒體、文化團體和活動，進行客家事務調查分析，並與海外客家事務進行合作交流。此類科不限科系且非客家人皆可報考，只要您對客家文化有興趣，此科絕對是您的首選。"
      },
      {
        id: 7,
        title: "一般警察特考 - 行政管理",
        tableData: [
          {
            type: "thead",
            rows: [
              ["年度", "考別", "報考人數", "到考人數"]
            ]
          },
          {
            type: "tbody",
            rows: [
              [{ content: "113年", rowSpan: 2 }, "二試", "-", "-"],
              ["一試", "48", "30"],
            ]
          },
          {
            type: "thead",
            rows: [
              ["需用人數", "錄取分數", "錄取人數", "錄取率"]
            ]
          },
          {
            type: "tbody",
            rows: [
              [{ content: "5", rowSpan: 2 }, "-", "-", "-"],
              ["51.20", "15", "50.00%"],
            ]
          }
        ],
        workInfo: "警察行政管理人員，為因應警察勤務需要，一律分發外勤勤務機構，24小時輪值之基層警察人員工作(包括巡邏、臨檢、值班和備勤等勤務)，主要從事警勤區、犯罪偵防、交通執法、群眾抗爭活動處理及執行人犯押送、戒護等工作。"
      },
      {
        id: 8,
        title: "112年地方特考三等",
        tableData: [
          {
            type: "thead",
            rows: [
              ["類科試別", "報名人數", "到考人數", "需用人數","錄取人數","錄取率"]
            ]
          },
          {
            type: "tbody",
            rows: [
              ["一般行政", "1321", "697", "39","39","5.60%"],
              ["一般民政", "284", "156", "22","22","14.10%"],
              ["客家二試", "4", "4",{content:"2",rowSpan:2},"2","50.00%"],
              ["客家一試", "26", "12","4","33.33%"],
              ["人事行政", "1531", "806", "57","57","7.07%"],
              ["環保行政", "192", "121", "10","10","8.26%"],
            ]
          }
        ],
        workInfo: "地方政府特考每年約在9月報名、12月考試，放榜日期約在每年的2~3月，113年地特五等考試將與初等考試合併舉行，相關職缺提列入初等考試，地方特考三等、四等考試減少應試科目，以改善地方特考提缺機關過去未獲分配錄取人員，及減輕應考人重複報名與重複應試的負擔。"
      },
      {
        id: 9,
        title: "112年地方特考四等",
        tableData: [
          {
            type: "thead",
            rows: [
              ["類科試別", "報名人數", "到考人數", "需用人數","錄取人數","錄取率"]
            ]
          },
          {
            type: "tbody",
            rows: [
              ["一般行政", "2948", "2060", "61","65","3.16%"],
              ["一般民政", "1909", "1230", "120","121","9.84%"],
              ["客家二試", "3", "3",{content:"1",rowSpan:2},"1","33.33%"],
              ["客家一試", "26", "14","3","21.43%"],
              ["人事行政", "1189", "735", "37","37","5.03%"],
              ["環保行政", "99", "58", "11","10","17.24%"],
              ["圖書資訊", "76", "46", "2","2","4.35%"],
            ]
          }
        ],
        workInfo: "地方政府特考每年約在9月報名、12月考試，放榜日期約在每年的2~3月，113年地特五等考試將與初等考試合併舉行，相關職缺提列入初等考試，地方特考三等、四等考試減少應試科目，以改善地方特考提缺機關過去未獲分配錄取人員，及減輕應考人重複報名與重複應試的負擔。"
      }
    ];
    setTableData(tableDataJson);
  }, []);
  return (
    <div className="App">
      <div className="container p-3 gy-5 d-flex flex-column align-items-center gap-3">
        <h2>國考相關資訊</h2>
        {
          tableData.map((data) => {
            return <InfoTableWithBtn key={data.id} data={data} />
          })
        }
      </div>
    </div>
  );
}

export default App;